app/controllers/comics_controller.rb

  def index
    @comics = Comic.all
---
SELECT * FROM "comics"

  def create
    @comic = Comic.new
    @comic.title = params[:comic][:title]
    if @comic.save
---
INSERT INTO "comics" ("created_at", "title", "updated_at") VALUES('2010-10-12 03:03:54', 'super amazing', '2010-10-12 03:03:54')

  def show
    @comic = Comic.find(params[:id])
---
SELECT * FROM "comics" WHERE ("comics"."id" = 1)